; domain
(define (domain ferry)
  (:requirements :strips :constraints :negative-preconditions)
   (:predicates (not-eq ?v3 ?v1)
		(pred_3 ?v2)
		(pred_6 ?v6)
		(pred_2 ?v6)
		(pred_1 ?v2 ?v6)
		(pred_5)
		(pred_4 ?v2))

   (:action op_3
       :parameters  (?v5 ?v7)
       :precondition (and (not-eq ?v5 ?v7) 
                          (pred_6 ?v5) (pred_6 ?v7) (pred_2 ?v5))
       :effect (and  (pred_2 ?v7)
		     (not (pred_2 ?v5))))


   (:action op_1
       :parameters (?v8 ?v4)
       :precondition  (and  (pred_3 ?v8) (pred_6 ?v4)
			    (pred_1 ?v8 ?v4) (pred_2 ?v4) (pred_5))
       :effect (and (pred_4 ?v8)
		    (not (pred_1 ?v8 ?v4)) 
		    (not (pred_5))))

   (:action op_2
       :parameters  (?v8  ?v4)
       :precondition  (and  (pred_3 ?v8) (pred_6 ?v4)
			    (pred_4 ?v8) (pred_2 ?v4))
       :effect (and (pred_1 ?v8 ?v4)
		    (pred_5)
		    (not (pred_4 ?v8)))))

; problem
(define (problem ferry-l6-c3)
(:domain ferry)
(:objects obj_06 obj_04 obj_05 obj_02 obj_03 obj_08 
          obj_01 obj_09 obj_07 
)
(:init
(pred_6 obj_06)
(pred_6 obj_04)
(pred_6 obj_05)
(pred_6 obj_02)
(pred_6 obj_03)
(pred_6 obj_08)
(pred_3 obj_01)
(pred_3 obj_09)
(pred_3 obj_07)
(not-eq obj_06 obj_04)
(not-eq obj_04 obj_06)
(not-eq obj_06 obj_05)
(not-eq obj_05 obj_06)
(not-eq obj_06 obj_02)
(not-eq obj_02 obj_06)
(not-eq obj_06 obj_03)
(not-eq obj_03 obj_06)
(not-eq obj_06 obj_08)
(not-eq obj_08 obj_06)
(not-eq obj_04 obj_05)
(not-eq obj_05 obj_04)
(not-eq obj_04 obj_02)
(not-eq obj_02 obj_04)
(not-eq obj_04 obj_03)
(not-eq obj_03 obj_04)
(not-eq obj_04 obj_08)
(not-eq obj_08 obj_04)
(not-eq obj_05 obj_02)
(not-eq obj_02 obj_05)
(not-eq obj_05 obj_03)
(not-eq obj_03 obj_05)
(not-eq obj_05 obj_08)
(not-eq obj_08 obj_05)
(not-eq obj_02 obj_03)
(not-eq obj_03 obj_02)
(not-eq obj_02 obj_08)
(not-eq obj_08 obj_02)
(not-eq obj_03 obj_08)
(not-eq obj_08 obj_03)
(pred_5)
(pred_1 obj_01 obj_05)
(pred_1 obj_09 obj_04)
(pred_1 obj_07 obj_05)
(pred_2 obj_08)
)
(:goal
(and
(pred_1 obj_01 obj_04)
(pred_1 obj_09 obj_02)
(pred_1 obj_07 obj_04)
)
)

(:constraints
  (and
    (sometime-before  (pred_1 obj_01 obj_04) (pred_2 obj_06))
    (sometime-before  (pred_1 obj_09 obj_02) (pred_2 obj_06))
    (sometime-before  (pred_1 obj_07 obj_04) (pred_2 obj_06))
  )
)
)

; plan
1. (op_3 obj_08 obj_05)
   deleted: (pred_2 obj_08)
   added: (pred_2 obj_05)
   goals met: 0 of 3
2. (op_1 obj_07 obj_05)
   deleted: (pred_1 obj_07 obj_05) (pred_5)
   added: (pred_4 obj_07)
   goals met: 0 of 3
3. (op_3 obj_05 obj_02)
   deleted: (pred_2 obj_05)
   added: (pred_2 obj_02)
   goals met: 0 of 3
4. (op_2 obj_07 obj_02)
   deleted: (pred_4 obj_07)
   added: (pred_1 obj_07 obj_02) (pred_5)
   goals met: 0 of 3
5. (op_3 obj_02 obj_05)
   deleted: (pred_2 obj_02)
   added: (pred_2 obj_05)
   goals met: 0 of 3
6. (op_1 obj_01 obj_05)
   deleted: (pred_1 obj_01 obj_05) (pred_5)
   added: (pred_4 obj_01)
   goals met: 0 of 3
7. (op_3 obj_05 obj_06)
   deleted: (pred_2 obj_05)
   added: (pred_2 obj_06)
   goals met: 0 of 3
8. (op_2 obj_01 obj_06)
   deleted: (pred_4 obj_01)
   added: (pred_1 obj_01 obj_06) (pred_5)
   goals met: 0 of 3
9. (op_3 obj_06 obj_02)
   deleted: (pred_2 obj_06)
   added: (pred_2 obj_02)
   goals met: 0 of 3
10. (op_1 obj_07 obj_02)
   deleted: (pred_1 obj_07 obj_02) (pred_5)
   added: (pred_4 obj_07)
   goals met: 0 of 3
11. (op_3 obj_02 obj_04)
   deleted: (pred_2 obj_02)
   added: (pred_2 obj_04)
   goals met: 0 of 3
12. (op_2 obj_07 obj_04)
   deleted: (pred_4 obj_07)
   added: (pred_1 obj_07 obj_04) (pred_5)
   goals met: 1 of 3
13. (op_1 obj_09 obj_04)
   deleted: (pred_1 obj_09 obj_04) (pred_5)
   added: (pred_4 obj_09)
   goals met: 1 of 3
14. (op_3 obj_04 obj_02)
   deleted: (pred_2 obj_04)
   added: (pred_2 obj_02)
   goals met: 1 of 3
15. (op_2 obj_09 obj_02)
   deleted: (pred_4 obj_09)
   added: (pred_1 obj_09 obj_02) (pred_5)
   goals met: 2 of 3
16. (op_3 obj_02 obj_06)
   deleted: (pred_2 obj_02)
   added: (pred_2 obj_06)
   goals met: 2 of 3
17. (op_1 obj_01 obj_06)
   deleted: (pred_1 obj_01 obj_06) (pred_5)
   added: (pred_4 obj_01)
   goals met: 2 of 3
18. (op_3 obj_06 obj_04)
   deleted: (pred_2 obj_06)
   added: (pred_2 obj_04)
   goals met: 2 of 3
19. (op_2 obj_01 obj_04)
   deleted: (pred_4 obj_01)
   added: (pred_1 obj_01 obj_04) (pred_5)
   goals met: 3 of 3
